tukano-artillery-tests/logs/db-hibernate-15.txt
--------------------------------
Summary report @ 00:39:13(+0000)
--------------------------------

http.codes.200: ................................................................ 2250
http.codes.204: ................................................................ 1350
http.downloaded_bytes: ......................................................... 177878
http.request_rate: ............................................................. 85/sec
http.requests: ................................................................. 3600
http.response_time:
  min: ......................................................................... 98
  max: ......................................................................... 471
  mean: ........................................................................ 145.8
  median: ...................................................................... 138.4
  p95: ......................................................................... 186.8
  p99: ......................................................................... 247.2
http.response_time.2xx:
  min: ......................................................................... 98
  max: ......................................................................... 471
  mean: ........................................................................ 145.8
  median: ...................................................................... 138.4
  p95: ......................................................................... 186.8
  p99: ......................................................................... 247.2
http.responses: ................................................................ 3600
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 450
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 450
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 111
  max: ......................................................................... 439
  mean: ........................................................................ 146
  median: ...................................................................... 141.2
  p95: ......................................................................... 172.5
  p99: ......................................................................... 247.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 114
  max: ......................................................................... 404
  mean: ........................................................................ 145.7
  median: ...................................................................... 141.2
  p95: ......................................................................... 183.1
  p99: ......................................................................... 232.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 122
  max: ......................................................................... 445
  mean: ........................................................................ 146.4
  median: ...................................................................... 141.2
  p95: ......................................................................... 186.8
  p99: ......................................................................... 237.5
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 115
  max: ......................................................................... 401
  mean: ........................................................................ 144.3
  median: ...................................................................... 138.4
  p95: ......................................................................... 172.5
  p99: ......................................................................... 247.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 109
  max: ......................................................................... 471
  mean: ........................................................................ 147.4
  median: ...................................................................... 138.4
  p95: ......................................................................... 190.6
  p99: ......................................................................... 252.2
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 116
  max: ......................................................................... 469
  mean: ........................................................................ 146.7
  median: ...................................................................... 141.2
  p95: ......................................................................... 186.8
  p99: ......................................................................... 257.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 118
  max: ......................................................................... 446
  mean: ........................................................................ 145.9
  median: ...................................................................... 138.4
  p95: ......................................................................... 186.8
  p99: ......................................................................... 232.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 98
  max: ......................................................................... 457
  mean: ........................................................................ 144.3
  median: ...................................................................... 138.4
  p95: ......................................................................... 179.5
  p99: ......................................................................... 228.2
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1484.7
  max: ......................................................................... 2277
  mean: ........................................................................ 1648.4
  median: ...................................................................... 1587.9
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2186.8